Version2/TestTool-NOP.13.12.SR1/TestTool.Setup/Requests/DeviceManagement/SetDNS/TC.DM.NVT.09_REQ_02.xml

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
               xmlns:tt="http://www.onvif.org/ver10/schema">
  <soap:Body>
    <tds:SetDNS>
      <tds:FromDHCP>true</tds:FromDHCP>
      <tds:SearchDomain>HOSTNAME</tds:SearchDomain>
      <tds:DNSManual>
        <tt:Type>IPv4</tt:Type>
        <tt:IPv4Address>10.1.1.1</tt:IPv4Address>
      </tds:DNSManual>
    </tds:SetDNS>
  </soap:Body>
</soap:Envelope>